In [1]:


import sqlite3
sqlite3.version
sqlite3.version_info
sqlite3.sqlite_version
sqlite3.sqlite_version_info

(3, 27, 2)

In [2]:
#CREATE
conn=sqlite3.connect('creating.db')
print("Opened database successfully")
cur=conn.cursor()

Opened database successfully

In [3]:
cur.execute('''
    CREATE TABLE COMPANY(
        ID INT PRIMARY KEY NOT NULL,
        NAME TEXT NOT NULL,
        AGE INT NOT NULL,
        ADDRESS CHAR(50),
        SALARY REAL);
''')


print("Table created successfully")

Table created successfully

In [5]:
cur.execute("INSERT INTO COMPANY (ID, NAME, AGE, ADDRESS, SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00)")
cur.execute("""
    INSERT INTO company (ID, NAME, AGE, ADDRESS, SALARY)
    VALUES (:id, :name, :age, :address, :salary)
""", {'id':2, 'name':'Allen', 'age':25, 'address':'Texas', 'salary':15000.00})
data = [(3, 'Teddy', 23, 'Norway', 200000.00), 
        (4, 'Mark', 25, 'Rich-Mond', 65000.00)]
cur.executemany("""
    INSERT INTO company (ID, NAME, AGE, ADDRESS, SALARY)
    VALUES (?, ?, ?, ?, ?)
""", data)
cur.executescript('''
    INSERT INTO company (ID, NAME, AGE, ADDRESS, SALARY)
    VALUES (5, 'Mark1', 25, 'Rich-Mond', 65000.00);
    
    INSERT INTO company (ID, NAME, AGE, ADDRESS, SALARY)
    VALUES (6, 'Mark2', 25, 'Rich-Mond', 65000.00);
''')

In [6]:
conn.commit()

In [8]:
conn = sqlite3.connect('./music.db')
curr = conn.cursor()

In [30]:
cur.executescript('''

CREATE TABLE Artist(
    id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    name TEXT
);

CREATE TABLE Genre(
    id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    name TEXT
);

CREATE TABLE Album(
    id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    artist_id INTEGER
);

CREATE TABLE Track(
    id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    title TEXT,
    length INTEGER,
    rating INTEGER,
    count INTEGER,
    album_id INTEGER,
    genre_id INTEGER
);

insert into Artist (name) values ('Led Zepplin');
insert into Artist (name) values ('22Led Zepplin');

insert into Genre (name) values ('LOLA');
insert into Genre (name) values ('22L');

''')	
curr.execute('''
    INSERT INTO album (title, artist_id)
    VALUES(:album, 
        (SELECT id
        FROM artist
        WHERE name = :artist));
''',{'album':'앨범이름', 'artist':'Led Zepplin'})

OperationalError: table Artist already exists

In [11]:
conn.commit()

In [14]:
curr.execute('''
    INSERT INTO album (title, artist_id)
    VALUES(:album, 
        (SELECT id
        FROM artist
        WHERE name = :artist));
''',{'album':'IV', 'artist':'Led Zepplin'})

In [15]:
conn.commit()

In [22]:
curr.execute('''
    INSERT INTO album(title,artist_id)
    VALUES(:album, 
        (SELECT id 
        FROM artist 
        WHERE name=:artist));
''',{'album':'Who made who', 'artist':'22Led Zepplin'})

In [23]:
conn.commit()

In [31]:
curr.execute('''
    INSERT INTO track (title, rating, length, count, album_id, genre_id)
    VALUES(:title, :rating, :length, :count,
            (SELECT id
            FROM album
            WHERE title=:album_title),:genre_id);
'''
,{'title':'Stairway', 'rating':5, 'length':482, 'count':0, 'album_title':'IV', 'genre_id':1})

In [32]:
conn.commit()

In [35]:
curr.execute('''
    SELECT album.title, artist.name
    FROM album
    JOIN artist
    ON album.artist_id=Artist.id

''')

In [36]:
for row in curr:
    print(row)

('앨범이름', 'Led Zepplin')
('앨범이름', 'Led Zepplin')
('앨범이름', 'Led Zepplin')
('IV', 'Led Zepplin')
('IV', 'Led Zepplin')
('Who made who', '22Led Zepplin')
('앨범이름', 'Led Zepplin')

In [37]:
curr.execute('''
    SELECT track.title, genre.name
    FROM track
    JOIN genre
    ON track.genre_id=genre.id
''')

In [38]:
for row in curr:
    print(row)

('Stairway', 'LOLA')
('Stairway', 'LOLA')

In [39]:
curr.execute('''
    SELECT album.title, track.title
    FROM track
    JOIN album
    ON track.album_id=album.id
''')

In [40]:
for row in curr:
    print(row)

('IV', 'Stairway')
('IV', 'Stairway')

In [42]:
curr.execute('''
    SELECT track.title, artist.name, album.title, genre.name
    FROM track
    JOIN artist JOIN album JOIN genre
    ON track.album_id=album.id
    AND track.genre_id=genre.id
    AND album.artist_id=artist.id
''')

In [43]:
for row in curr:
    print(row)

('Stairway', 'Led Zepplin', 'IV', 'LOLA')
('Stairway', 'Led Zepplin', 'IV', 'LOLA')